; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v5 ?v6)
             (pred_10 ?v11 ?v4)
             (pred_2 ?v5 ?v4)
             (pred_7 ?v9 ?v5 )
	     (pred_12 ?v5)
             (pred_11 ?v1)
             (pred_1 ?v11)
             (pred_5 ?v4)
             (pred_6 ?v5)
             (pred_4 ?v11)
             (pred_3 ?v5)
             (pred_9 ))



(:action op_5
:parameters (?v12 ?v2 ?v7 ?v13)
:precondition (and (pred_11 ?v12) (pred_11 ?v2) (pred_1 ?v7) (pred_5 ?v13)
          (pred_8 ?v12 ?v2) (pred_10 ?v7 ?v13)
                   (pred_2 ?v2 ?v13) (pred_12 ?v12) 
                   (pred_6 ?v2) (pred_4 ?v7))
:effect (and  (pred_3 ?v2) (not (pred_6 ?v2))))


(:action op_2
:parameters (?v12 ?v3)
:precondition (and (pred_11 ?v12) (pred_11 ?v3)
               (pred_12 ?v12) (pred_8 ?v12 ?v3) (pred_3 ?v3))
:effect (and (pred_12 ?v3) (not (pred_12 ?v12))))

(:action op_1
:parameters (?v12 ?v7)
:precondition (and (pred_11 ?v12) (pred_1 ?v7) 
                  (pred_12 ?v12) (pred_7 ?v7 ?v12) (pred_9 ))
:effect (and (pred_4 ?v7)
   (not (pred_7 ?v7 ?v12)) (not (pred_9 ))))


(:action op_3
:parameters (?v12 ?v10 ?v8)
:precondition (and (pred_11 ?v12) (pred_1 ?v10) (pred_1 ?v8)
                  (pred_12 ?v12) (pred_4 ?v8) (pred_7 ?v10 ?v12))
:effect (and (pred_4 ?v10) (pred_7 ?v8 ?v12)
        (not (pred_4 ?v8)) (not (pred_7 ?v10 ?v12))))

(:action op_4
:parameters (?v12 ?v7)
:precondition (and (pred_11 ?v12) (pred_1 ?v7) 
                  (pred_12 ?v12) (pred_4 ?v7))
:effect (and (pred_9 ) (pred_7 ?v7 ?v12) (not (pred_4 ?v7)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_09 obj_16 obj_15 obj_06 obj_25 obj_04 obj_20 obj_12 obj_29 obj_11 obj_13 obj_21 obj_23 obj_28 obj_24 obj_18 obj_22 obj_02 obj_30 obj_07 obj_14 obj_27 obj_03 obj_26 obj_19
    obj_08 obj_17 obj_10
    obj_01 obj_31 obj_05
    )

    (:init
       (pred_9)

       (pred_11 obj_09)
       (pred_11 obj_16)
       (pred_11 obj_15)
       (pred_11 obj_06)
       (pred_11 obj_25)
       (pred_11 obj_04)
       (pred_11 obj_20)
       (pred_11 obj_12)
       (pred_11 obj_29)
       (pred_11 obj_11)
       (pred_11 obj_13)
       (pred_11 obj_21)
       (pred_11 obj_23)
       (pred_11 obj_28)
       (pred_11 obj_24)
       (pred_11 obj_18)
       (pred_11 obj_22)
       (pred_11 obj_02)
       (pred_11 obj_30)
       (pred_11 obj_07)
       (pred_11 obj_14)
       (pred_11 obj_27)
       (pred_11 obj_03)
       (pred_11 obj_26)
       (pred_11 obj_19)
       (pred_5 obj_08)
       (pred_5 obj_17)
       (pred_5 obj_10)
       (pred_1 obj_01)
       (pred_1 obj_31)
       (pred_1 obj_05)

       (pred_8 obj_09 obj_04)
       (pred_8 obj_09 obj_16)
       (pred_8 obj_16 obj_20)
       (pred_8 obj_16 obj_15)
       (pred_8 obj_16 obj_09)
       (pred_8 obj_15 obj_12)
       (pred_8 obj_15 obj_06)
       (pred_8 obj_15 obj_16)
       (pred_8 obj_06 obj_29)
       (pred_8 obj_06 obj_25)
       (pred_8 obj_06 obj_15)
       (pred_8 obj_25 obj_11)
       (pred_8 obj_25 obj_06)
       (pred_8 obj_04 obj_13)
       (pred_8 obj_04 obj_20)
       (pred_8 obj_04 obj_09)
       (pred_8 obj_20 obj_21)
       (pred_8 obj_20 obj_12)
       (pred_8 obj_20 obj_16)
       (pred_8 obj_20 obj_04)
       (pred_8 obj_12 obj_23)
       (pred_8 obj_12 obj_29)
       (pred_8 obj_12 obj_15)
       (pred_8 obj_12 obj_20)
       (pred_8 obj_29 obj_28)
       (pred_8 obj_29 obj_11)
       (pred_8 obj_29 obj_06)
       (pred_8 obj_29 obj_12)
       (pred_8 obj_11 obj_24)
       (pred_8 obj_11 obj_25)
       (pred_8 obj_11 obj_29)
       (pred_8 obj_13 obj_18)
       (pred_8 obj_13 obj_21)
       (pred_8 obj_13 obj_04)
       (pred_8 obj_21 obj_22)
       (pred_8 obj_21 obj_23)
       (pred_8 obj_21 obj_20)
       (pred_8 obj_21 obj_13)
       (pred_8 obj_23 obj_02)
       (pred_8 obj_23 obj_28)
       (pred_8 obj_23 obj_12)
       (pred_8 obj_23 obj_21)
       (pred_8 obj_28 obj_30)
       (pred_8 obj_28 obj_24)
       (pred_8 obj_28 obj_29)
       (pred_8 obj_28 obj_23)
       (pred_8 obj_24 obj_07)
       (pred_8 obj_24 obj_11)
       (pred_8 obj_24 obj_28)
       (pred_8 obj_18 obj_14)
       (pred_8 obj_18 obj_22)
       (pred_8 obj_18 obj_13)
       (pred_8 obj_22 obj_27)
       (pred_8 obj_22 obj_02)
       (pred_8 obj_22 obj_21)
       (pred_8 obj_22 obj_18)
       (pred_8 obj_02 obj_03)
       (pred_8 obj_02 obj_30)
       (pred_8 obj_02 obj_23)
       (pred_8 obj_02 obj_22)
       (pred_8 obj_30 obj_26)
       (pred_8 obj_30 obj_07)
       (pred_8 obj_30 obj_28)
       (pred_8 obj_30 obj_02)
       (pred_8 obj_07 obj_19)
       (pred_8 obj_07 obj_24)
       (pred_8 obj_07 obj_30)
       (pred_8 obj_14 obj_27)
       (pred_8 obj_14 obj_18)
       (pred_8 obj_27 obj_03)
       (pred_8 obj_27 obj_22)
       (pred_8 obj_27 obj_14)
       (pred_8 obj_03 obj_26)
       (pred_8 obj_03 obj_02)
       (pred_8 obj_03 obj_27)
       (pred_8 obj_26 obj_19)
       (pred_8 obj_26 obj_30)
       (pred_8 obj_26 obj_03)
       (pred_8 obj_19 obj_07)
       (pred_8 obj_19 obj_26)
       (pred_6 obj_12)
       (pred_6 obj_03)
       (pred_6 obj_28)
       (pred_2  obj_12 obj_08)
       (pred_2  obj_03 obj_17)
       (pred_2  obj_28 obj_10)
       (pred_3 obj_09)
       (pred_3 obj_16)
       (pred_3 obj_15)
       (pred_3 obj_06)
       (pred_3 obj_25)
       (pred_3 obj_04)
       (pred_3 obj_20)
       (pred_3 obj_29)
       (pred_3 obj_11)
       (pred_3 obj_13)
       (pred_3 obj_21)
       (pred_3 obj_23)
       (pred_3 obj_24)
       (pred_3 obj_18)
       (pred_3 obj_22)
       (pred_3 obj_02)
       (pred_3 obj_30)
       (pred_3 obj_07)
       (pred_3 obj_14)
       (pred_3 obj_27)
       (pred_3 obj_26)
       (pred_3 obj_19)

       (pred_10  obj_01 obj_08)
       (pred_10  obj_31 obj_17)
       (pred_10  obj_05 obj_10)
       (pred_7 obj_01 obj_25)
       (pred_7 obj_31 obj_15)
       (pred_7 obj_05 obj_21)
       (pred_12 obj_13)
    )

    (:goal (and
       (pred_7 obj_31 obj_13)
       (pred_7 obj_05 obj_13)
    ))
(:constraints
  (always (not (pred_12 obj_04)))
)
)

; plan
1. (op_2 obj_13 obj_21)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_21)
   goals met: 0 of 2
2. (op_1 obj_21 obj_05)
   deleted: (pred_7 obj_05 obj_21) (pred_9)
   added: (pred_4 obj_05)
   goals met: 0 of 2
3. (op_2 obj_21 obj_13)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_13)
   goals met: 0 of 2
4. (op_4 obj_13 obj_05)
   deleted: (pred_4 obj_05)
   added: (pred_9) (pred_7 obj_05 obj_13)
   goals met: 1 of 2
5. (op_2 obj_13 obj_21)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_21)
   goals met: 1 of 2
6. (op_2 obj_21 obj_20)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_20)
   goals met: 1 of 2
7. (op_2 obj_20 obj_16)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_16)
   goals met: 1 of 2
8. (op_2 obj_16 obj_15)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_15)
   goals met: 1 of 2
9. (op_1 obj_15 obj_31)
   deleted: (pred_7 obj_31 obj_15) (pred_9)
   added: (pred_4 obj_31)
   goals met: 1 of 2
10. (op_2 obj_15 obj_16)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_16)
   goals met: 1 of 2
11. (op_2 obj_16 obj_20)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_20)
   goals met: 1 of 2
12. (op_2 obj_20 obj_21)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_21)
   goals met: 1 of 2
13. (op_2 obj_21 obj_13)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_13)
   goals met: 1 of 2
14. (op_4 obj_13 obj_31)
   deleted: (pred_4 obj_31)
   added: (pred_9) (pred_7 obj_31 obj_13)
   goals met: 2 of 2
